# 16 Дано число обозначающее день недели. Выяснить является номер дня недели выходным
# day = 'monday tuesday wednesday thursday friday saturday sunday'
# a = int (input('Введите номер дня недели от 1 до 7\n'))
# if a<=0 and a>=8:
#     print ('данные введены не корректно ') # кусок кода не работает 
# else:
#     if a==1:
#         print (day[:6])
# if a==2:
#     print (day[7:14])
# if a==3:
#     print (day[15:24])
# if a==4:
#     print (day[25:34])    
# if a==5:
#     print (day[34:40])
# if a==6:
#     print (day[41:49])
# if a==7:
#     print (day[50:57])
# if a>5:
#     print('Дни являются выходными ')


# 17 По двум заданным числам проверять является ли одно квадратом другого
# a = 16 #int (input())
# b = 4 #int (input())
# if a==b*b:
#     print('{0} - является квадратом числа {1}'.format(a,b))
# else:
#     print('не является')

# 18 Проверить истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y

# 19 Определить номер четверти плоскости, в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
# 20 Задать номер четверти, показать диапазоны для возможных координат
# 21 Программа проверяет пятизначное число на палиндромом.
# 22 Найти расстояние между точками в пространстве 2D/3D
# 23 Показать таблицу квадратов чисел от 1 до N
# 24 Найти кубы чисел от 1 до N
# 25 Найти сумму чисел от 1 до А
# 26 Возведите число А в натуральную степень B используя цикл
# 27 Определить количество цифр в числе
# 28 Подсчитать сумму цифр в числе
# 29 Написать программу вычисления произведения чисел от 1 до N
# 30 Показать кубы чисел, заканчивающихся на четную цифру и не заканчивающее на 0
