# print('введите а');
# a = input ()
# print('введите b');
# b = input ()
# #print (a,b)
# print('{1} - {0}'.format(a,b))


#По двум заданным числам проверить является ли одно квадратом второго 
# a = int (3)
# b = int (9)  
# if a*a==b:
#     print ('{0} - является квадратом {1}'.format(a,b)) 
# else:
#     print ('{0} - не является квадратом {1}'.format(a,b)) 

#Найти максимальное из пяти чисел
# a = int (3)
# b = int (9)
# c = int (25)
# d = int (15)
# e = int (90)
# MAX = a
# if MAX<b:
#     MAX=b
# if MAX<c:
#     MAX=c
# if MAX<d:
#     MAX=d
# if MAX<e:
#     MAX=e
# print(MAX)

#Вывести на экран числа от -N до N
# n=4
# for i in range(-n,n+1):
#     print(i)

#Показать первую цифру дробной части числа
# a=12.51
# b=int ((a*100)%10)
# print(b)

#Удалить вторую цифру трёхзначного числа
# original = int (input('введите число '))
# edit = (int(original/100))
# s = int(original/100)
# print (edit)
#hрешение Николая    
# num = int(input('3digit number: '))
# new = (int(num%10)) + (int(num/100))*10
# print (new)


#Найти третью цифру числа или сообщить, что её нет
# num = int (input('enter a number'))

# if num < 99:
#     print (num%10)
# else:
#     print ("")

# a = int (input('введите число:'))
# print('квадрат числа {} - это {}'.format(a,a**))

#сравнить два числа 
# num_a = int(input('please provide 1st number:'))
# num_b = int(input('please provide 2nd number:'))
# if num_a > num_b:
#     print('1st number is larger')
# else:
#     print('2nd number is larger')


#Найти максимальное из трех чисел
# a, b, c = int(input()), int(input()), int(input()) возможный вариант ввода 3 переменных в одну строку
# a = int (input('enter a:'))
# b = int (input('enter b:'))
# c = int (input('enter c:'))
# numbers = []
# numbers.append(a)
# numbers.append(b)
# numbers.appeend(c)
# for i in range (3):
#     a = int (input())
#     print (numbers)

